mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs_freertos/main.c
static void task_create_func(){   
    #if NRF_LOG_ENABLED
        // Start execution.
        if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
        {
            APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
        }
    #endif 
        
    queue_init();//create queue
    
    if(pdPASS != xTaskCreate(task1, "TASK1", configMINIMAL_STACK_SIZE+30, NULL, 2, &m_task1_thread))
    {
        NRF_LOG_INFO("create task1 error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
    if(pdPASS != xTaskCreate(task2, "TASK2", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_task2_thread))
    {
        NRF_LOG_INFO("create task2 error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }     
//    if(pdPASS != xTaskCreate(send_task, "send_task", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_receive_task_thread))
//    {
//        NRF_LOG_INFO("create m_receive_task_thread error");
//        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
//    }     
//    if(pdPASS != xTaskCreate(receive_task, "receive_task", configMINIMAL_STACK_SIZE+10, NULL, 2, &m_send_task_thread))
//    {
//        NRF_LOG_INFO("create receive_task error");
//        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
//    }     
    //该任务主要是创建2个定时器，创建完了只有就会将该任务删除
    if(pdPASS != xTaskCreate(app_task_create, "APP_TASK_CREATE", configMINIMAL_STACK_SIZE+10, NULL, 2, &AppTaskCreate_Handle))
    {
        NRF_LOG_INFO("create app task error");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }     
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize modules.
    log_init();
    clock_init();

    // Do not start any interrupt that uses system functions before system initialisation.
    // The best solution is to start the OS before any other initalisation.

    // Activate deep sleep mode.
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    // Configure and initialize the BLE stack.
    ble_stack_init();

    // Initialize modules.
    timers_init();
    buttons_leds_init(&erase_bonds);
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    //application_timers_start();
    
    task_create_func();

    // Create a FreeRTOS task for the BLE stack.
    // The task will run advertising_start() before entering its loop.
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    NRF_LOG_INFO("HRS FreeRTOS example started.");       
    
    // Start FreeRTOS scheduler.
    vTaskStartScheduler();

    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}

/*
@renfence:https://github.com/lee35210/nRF52840_BLE_FREERTOS_MLX90614/blob/master/main.c
*/


